// 3. Написать программу масштабирования фигуры (0,0)(2,0)(2,2)(0,2)



Console.WriteLine("Введите координаты вершин фигуры списком: ");
string point = Convert.ToString(Console.ReadLine() ?? "0");
//PrintArray(point);
Console.WriteLine(point[6]);



//Console.WriteLine("Введите коэффициент масштабированик: ");
//int k = int.Parse(Console.ReadLine() ?? "0");
///ResizeFigure(x1, y1, x2, y2, x3, y3, x4, y4, k);